In [20]:
import torch
import pandas as pd
import numpy as np
import os

In [3]:
torch.cuda.is_available(), torch.__version__

(True, '2.0.1')

In [17]:
file_dir = './__dataset'

def check_pkl_file(file_name):
    file_arr = file_name.split('.')
    pkl_file_name = '_'.join(file_arr) + '.pkl'
    files = os.listdir(file_dir)    
    return pkl_file_name in files, f'{file_dir}/{pkl_file_name}'

In [5]:
df_1h9t = pd.read_fwf('./__dataset/1h9t_traj.xyz')

In [6]:
df_1h9t

               8993  Unnamed: 1  Unnamed: 2  Unnamed: 3
0         generated      by VMD         NaN         NaN
1                 N  -57.584381   34.978298  159.481232
2                H1  -57.861336   35.784279  160.104431
3                H2  -57.304367   35.498142  158.619400
4                H3  -58.363346   34.340218  159.397354
...             ...         ...         ...         ...
59097144         H1   -9.935467   -3.359665  170.869949
59097145         H2   -8.470885   -3.028969  170.649261
59097146          O    7.218987   42.856380   97.068260
59097147         H1    6.664699   42.867878   96.188118
59097148         H2    8.109908   42.881283   96.648109

[59097149 rows x 4 columns]

In [8]:
raw_df = df_1h9t[[df_1h9t.columns[1], df_1h9t.columns[2], df_1h9t.columns[3]]]
raw_df

          Unnamed: 1  Unnamed: 2  Unnamed: 3
0             by VMD         NaN         NaN
1         -57.584381   34.978298  159.481232
2         -57.861336   35.784279  160.104431
3         -57.304367   35.498142  158.619400
4         -58.363346   34.340218  159.397354
...              ...         ...         ...
59097144   -9.935467   -3.359665  170.869949
59097145   -8.470885   -3.028969  170.649261
59097146    7.218987   42.856380   97.068260
59097147    6.664699   42.867878   96.188118
59097148    8.109908   42.881283   96.648109

[59097149 rows x 3 columns]

In [9]:
# remove NaN
raw_df = raw_df.dropna()

In [10]:
raw_df

          Unnamed: 1  Unnamed: 2  Unnamed: 3
1         -57.584381   34.978298  159.481232
2         -57.861336   35.784279  160.104431
3         -57.304367   35.498142  158.619400
4         -58.363346   34.340218  159.397354
5         -56.345375   34.299068  159.865143
...              ...         ...         ...
59097144   -9.935467   -3.359665  170.869949
59097145   -8.470885   -3.028969  170.649261
59097146    7.218987   42.856380   97.068260
59097147    6.664699   42.867878   96.188118
59097148    8.109908   42.881283   96.648109

[59084010 rows x 3 columns]

In [13]:
59084010/8993

6570.0

In [14]:
coordinates = raw_df.to_numpy(dtype=np.float32)
coordinates.shape

(59084010, 3)

In [15]:
coordinates = coordinates.reshape([6570, 8993, 3])
coordinates.shape

(6570, 8993, 3)

In [17]:
torch.save(coordinates, './__dataset/1h9t_traj_xyz.pkl')

In [6]:
coordinates = torch.load('./__dataset/1h9t_traj_xyz.pkl')

In [7]:
coordinates.shape

(6570, 8993, 3)

In [22]:
file_name = '1fme_md.xyz'

In [8]:
df_1fme = pd.read_fwf(file_name)

In [9]:
df_1fme

         Unnamed: 0    504  Unnamed: 2  Unnamed: 3
0                 N -44.57       -8.73      -20.92
1                 H -45.31       -8.30      -21.46
2                 H -44.91       -9.54      -20.44
3                 H -43.87       -9.06      -21.57
4                 C -43.93       -7.79      -20.01
...             ...    ...         ...         ...
50499994          H  -8.00        0.69        0.51
50499995          H   0.77        1.99       -1.29
50499996          C  -5.18        0.86       -3.33
50499997          O  -5.66        1.61       -2.41
50499998          O  -4.51        0.17       -3.11

[50499999 rows x 4 columns]

In [12]:
raw_df = df_1fme[[df_1fme.columns[1], df_1fme.columns[2], df_1fme.columns[3]]]
raw_df

            504  Unnamed: 2  Unnamed: 3
0        -44.57       -8.73      -20.92
1        -45.31       -8.30      -21.46
2        -44.91       -9.54      -20.44
3        -43.87       -9.06      -21.57
4        -43.93       -7.79      -20.01
...         ...         ...         ...
50499994  -8.00        0.69        0.51
50499995   0.77        1.99       -1.29
50499996  -5.18        0.86       -3.33
50499997  -5.66        1.61       -2.41
50499998  -4.51        0.17       -3.11

[50499999 rows x 3 columns]

In [13]:
# remove NaN
raw_df = raw_df.dropna()

In [14]:
raw_df

            504  Unnamed: 2  Unnamed: 3
0        -44.57       -8.73      -20.92
1        -45.31       -8.30      -21.46
2        -44.91       -9.54      -20.44
3        -43.87       -9.06      -21.57
4        -43.93       -7.79      -20.01
...         ...         ...         ...
50499994  -8.00        0.69        0.51
50499995   0.77        1.99       -1.29
50499996  -5.18        0.86       -3.33
50499997  -5.66        1.61       -2.41
50499998  -4.51        0.17       -3.11

[50400000 rows x 3 columns]

In [15]:
coordinates = raw_df.to_numpy(dtype=np.float32)
coordinates.shape

(50400000, 3)

In [16]:
coordinates = coordinates.reshape([100000, 504, 3])
coordinates.shape

(100000, 504, 3)

In [23]:
is_present, pickle_file_name = check_pkl_file(file_name)
is_present, pickle_file_name

(False, './__dataset/1fme_md_xyz.pkl')

In [24]:
torch.save(coordinates, pickle_file_name)

In [26]:
torch.load(pickle_file_name).shape

(100000, 504, 3)